bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA164PA.xml
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
                    <bitfield caption="" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1">
                    <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
                </register>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
                    <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
                </register>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
                    <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
                    <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
                    <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
                    <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
                    <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
                    <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
                    <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
                    <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
                </register>
                <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
                    <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
                    <bitfield caption="Power Reduction USART1" mask="0x10" name="PRUSART1"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>

        </module>
    </modules>
    <pinouts>
        <pinout name="DRQFN_44">
            <pin pad="PB5" position="A1"/>
            <pin pad="PB6" position="B1"/>
            <pin pad="PB7" position="A2"/>
            <pin pad="RESET" position="B2"/>
            <pin pad="VCC" position="A3"/>
            <pin pad="GND" position="B3"/>
            <pin pad="XTAL2" position="A4"/>
            <pin pad="XTAL1" position="B4"/>
            <pin pad="PD0" position="A5"/>
            <pin pad="PD1" position="B5"/>
            <pin pad="PD2" position="A6"/>
            <pin pad="PD3" position="A7"/>
            <pin pad="PD4" position="B6"/>
            <pin pad="PD5" position="A8"/>
            <pin pad="PD6" position="B7"/>
            <pin pad="PD7" position="A9"/>
            <pin pad="VCC" position="B8"/>
            <pin pad="GND" position="A10"/>
            <pin pad="PC0" position="B9"/>
            <pin pad="PC1" position="A11"/>
            <pin pad="PC2" position="B10"/>
            <pin pad="PC3" position="A12"/>
            <pin pad="PC4" position="A13"/>
            <pin pad="PC5" position="B11"/>
            <pin pad="PC6" position="A14"/>
            <pin pad="PC7" position="B12"/>
            <pin pad="AVCC" position="A15"/>
            <pin pad="GND" position="B13"/>
            <pin pad="AREF" position="A16"/>
            <pin pad="PA7" position="B14"/>
            <pin pad="PA6" position="A17"/>
            <pin pad="PA5" position="B15"/>
            <pin pad="PA4" position="A18"/>
            <pin pad="PA3" position="A19"/>
            <pin pad="PA2" position="B16"/>
            <pin pad="PA1" position="A20"/>
            <pin pad="PA0" position="B17"/>
            <pin pad="VCC" position="A21"/>
            <pin pad="GND" position="B18"/>
            <pin pad="PB0" position="A22"/>
            <pin pad="PB1" position="B19"/>
            <pin pad="PB2" position="A23"/>
            <pin pad="PB3" position="B20"/>
            <pin pad="PB4" position="A24"/>
        </pinout>
        <pinout name="PDIP40" caption="PDIP40">
            <pin position="1" pad="PB0"/>
            <pin position="2" pad="PB1"/>
            <pin position="3" pad="PB2"/>
            <pin position="4" pad="PB3"/>
            <pin position="5" pad="PB4"/>
            <pin position="6" pad="PB5"/>
            <pin position="7" pad="PB6"/>
            <pin position="8" pad="PB7"/>
            <pin position="9" pad="RESET"/>
            <pin position="10" pad="VCC"/>
            <pin position="11" pad="GND"/>
            <pin position="12" pad="XTAL2"/>
            <pin position="13" pad="XTAL1"/>
            <pin position="14" pad="PD0"/>
            <pin position="15" pad="PD1"/>
            <pin position="16" pad="PD2"/>
            <pin position="17" pad="PD3"/>
            <pin position="18" pad="PD4"/>
            <pin position="19" pad="PD5"/>
            <pin position="20" pad="PD6"/>
            <pin position="21" pad="PD7"/>
            <pin position="22" pad="PC0"/>
            <pin position="23" pad="PC1"/>
            <pin position="24" pad="PC2"/>
            <pin position="25" pad="PC3"/>
            <pin position="26" pad="PC4"/>
            <pin position="27" pad="PC5"/>
            <pin position="28" pad="PC6"/>
            <pin position="29" pad="PC7"/>
            <pin position="30" pad="AVCC"/>
            <pin position="31" pad="GND"/>
            <pin position="32" pad="AREF"/>
            <pin position="33" pad="PA7"/>
            <pin position="34" pad="PA6"/>
            <pin position="35" pad="PA5"/>
            <pin position="36" pad="PA4"/>
            <pin position="37" pad="PA3"/>
            <pin position="38" pad="PA2"/>
            <pin position="39" pad="PA1"/>
            <pin position="40" pad="PA0"/>
        </pinout>
        <pinout name="TQFP_QFN_44" caption="TQFP_QFN_44">
            <pin position="1" pad="PB5"/>
            <pin position="2" pad="PB6"/>
            <pin position="3" pad="PB7"/>
            <pin position="4" pad="RESET"/>
            <pin position="5" pad="VCC"/>
            <pin position="6" pad="GND"/>
            <pin position="7" pad="XTAL2"/>
            <pin position="8" pad="XTAL1"/>
            <pin position="9" pad="PD0"/>
            <pin position="10" pad="PD1"/>
            <pin position="11" pad="PD2"/>
            <pin position="12" pad="PD3"/>
            <pin position="13" pad="PD4"/>
            <pin position="14" pad="PD5"/>
            <pin position="15" pad="PD6"/>
            <pin position="16" pad="PD7"/>
            <pin position="17" pad="VCC"/>
            <pin position="18" pad="GND"/>
            <pin position="19" pad="PC0"/>
            <pin position="20" pad="PC1"/>
            <pin position="21" pad="PC2"/>
            <pin position="22" pad="PC3"/>
            <pin position="23" pad="PC4"/>
            <pin position="24" pad="PC5"/>
            <pin position="25" pad="PC6"/>
            <pin position="26" pad="PC7"/>
            <pin position="27" pad="AVCC"/>
            <pin position="28" pad="GND"/>
            <pin position="29" pad="REF"/>
            <pin position="30" pad="PA7"/>
            <pin position="31" pad="PA6"/>
            <pin position="32" pad="PA5"/>
            <pin position="33" pad="PA4"/>
            <pin position="34" pad="PA3"/>
            <pin position="35" pad="PA2"/>
            <pin position="36" pad="PA1"/>
            <pin position="37" pad="PA0"/>
            <pin position="38" pad="VCC"/>
            <pin position="39" pad="GND"/>
            <pin position="40" pad="PB0"/>
            <pin position="41" pad="PB1"/>
            <pin position="42" pad="PB2"/>
            <pin position="43" pad="PB3"/>
            <pin position="44" pad="PB4"/>
        </pinout>
        <pinout name="VFBGA49" caption="VFBGA49">
            <pin position="A1" pad="GND"/>
            <pin position="A2" pad="PB4"/>
            <pin position="A3" pad="PB2"/>
            <pin position="A4" pad="GND"/>
            <pin position="A5" pad="VCC"/>
            <pin position="A6" pad="PA2"/>
            <pin position="A7" pad="GND"/>
            <pin position="B1" pad="PB6"/>
            <pin position="B2" pad="PB5"/>
            <pin position="B3" pad="PB3"/>
            <pin position="B4" pad="PB0"/>
            <pin position="B5" pad="PA0"/>
            <pin position="B6" pad="PA3"/>
            <pin position="B7" pad="PA5"/>
            <pin position="C1" pad="VCC"/>
            <pin position="C2" pad="RESET"/>
            <pin position="C3" pad="PB7"/>
            <pin position="C4" pad="PB1"/>
            <pin position="C5" pad="PA1"/>
            <pin position="C6" pad="PA6"/>
            <pin position="C7" pad="AREF"/>
            <pin position="D1" pad="GND"/>
            <pin position="D2" pad="XTAL2"/>
            <pin position="D3" pad="PD0"/>
            <pin position="D4" pad="GND"/>
            <pin position="D5" pad="PA4"/>
            <pin position="D6" pad="PA7"/>
            <pin position="D7" pad="GND"/>
            <pin position="E1" pad="XTAL1"/>
            <pin position="E2" pad="PD1"/>
            <pin position="E3" pad="PD5"/>
            <pin position="E4" pad="PD7"/>
            <pin position="E5" pad="PC5"/>
            <pin position="E6" pad="PC7"/>
            <pin position="E7" pad="AVCC"/>
            <pin position="F1" pad="PD2"/>
            <pin position="F2" pad="PD3"/>
            <pin position="F3" pad="PD6"/>
            <pin position="F4" pad="PC0"/>
            <pin position="F5" pad="PC2"/>
            <pin position="F6" pad="PC4"/>
            <pin position="F7" pad="PC6"/>
            <pin position="G1" pad="GND"/>
            <pin position="G2" pad="PD4"/>
            <pin position="G3" pad="VCC"/>
            <pin position="G4" pad="GND"/>
            <pin position="G5" pad="PC1"/>
            <pin position="G6" pad="PC3"/>
            <pin position="G7" pad="GND"/>
        </pinout>
    </pinouts>
</part-description-file>